perf/ping/baseline-ping.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    cluster:
      target: 'http://localhost:5555/node/cluster'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Warm up
      duration: 60
      arrivalRate: 10
    - name: Ramp up
      duration: 120
      arrivalRate: 10
      rampTo: 50
    - name: Plain
      duration: 180
      arrivalRate: 50

scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/ping'