perf/ping/explorative-stress-testing-ping.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    cluster:
      target: 'http://localhost:5555/node/cluster'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Plain 1
      duration: 60
      arrivalRate: 50
    - name: Ramp up 1
      duration: 120
      arrivalRate: 50
      rampTo: 100
    - name: Plain 2
      duration: 120
      arrivalRate: 100
    - name: Ramp up 2
      duration: 120
      arrivalRate: 100
      rampTo: 200
    - name: Plain 3
      duration: 120
      arrivalRate: 200


scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/ping'