perf/ping/explorative-stress-testing-ping2.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    cluster:
      target: 'http://localhost:5555/node/cluster'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Plain 1
      duration: 60
      arrivalRate: 100
    - name: Ramp Up 1
      duration: 60
      arrivalRate: 50
      rampTo: 150
    - name: Plain 2
      duration: 60
      arrivalRate: 150
    - name: Ramp Up 2
      duration: 60
      arrivalRate: 150
      rampTo: 200

scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/ping'